app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @products = Product.all # Product モデルに対して .all メソッドを呼びだしている。@products インスタンス変数に代入している